<?php
if (isset($idsp) && $show_pd_detail) {
?>
  <form action="" method="post">
    <section class="product-information mt-80">
      <div class="container">
        <div class="site-product-information">
          <div class="spi-images">
            <div class="spi-i-arrow-left">
              <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M13.8166 18.8173C13.6649 18.9758 13.5459 19.1627 13.4666 19.3673C13.2999 19.7731 13.2999 20.2282 13.4666 20.634C13.5459 20.8386 13.6649 21.0255 13.8166 21.184L18.8166 26.184C19.1304 26.4978 19.5561 26.6741 19.9999 26.6741C20.4438 26.6741 20.8694 26.4978 21.1833 26.184C21.4971 25.8701 21.6734 25.4445 21.6734 25.0007C21.6734 24.5568 21.4971 24.1312 21.1833 23.8173L19.0166 21.6673H24.9999C25.4419 21.6673 25.8659 21.4917 26.1784 21.1792C26.491 20.8666 26.6666 20.4427 26.6666 20.0007C26.6666 19.5586 26.491 19.1347 26.1784 18.8221C25.8659 18.5096 25.4419 18.334 24.9999 18.334H19.0166L21.1833 16.184C21.3395 16.029 21.4635 15.8447 21.5481 15.6416C21.6327 15.4385 21.6763 15.2207 21.6763 15.0007C21.6763 14.7806 21.6327 14.5628 21.5481 14.3597C21.4635 14.1566 21.3395 13.9723 21.1833 13.8173C21.0283 13.6611 20.844 13.5371 20.6409 13.4525C20.4378 13.3679 20.2199 13.3243 19.9999 13.3243C19.7799 13.3243 19.5621 13.3679 19.359 13.4525C19.1559 13.5371 18.9715 13.6611 18.8166 13.8173L13.8166 18.8173ZM3.33325 20.0007C3.33325 23.297 4.31073 26.5193 6.14209 29.2602C7.97345 32.001 10.5764 34.1372 13.6219 35.3986C16.6673 36.6601 20.0184 36.9902 23.2514 36.3471C26.4844 35.704 29.4542 34.1166 31.785 31.7858C34.1159 29.4549 35.7033 26.4852 36.3463 23.2522C36.9894 20.0191 36.6594 16.668 35.3979 13.6226C34.1365 10.5772 32.0002 7.97418 29.2594 6.14282C26.5186 4.31147 23.2963 3.33398 19.9999 3.33398C17.8112 3.33398 15.644 3.76508 13.6219 4.60266C11.5998 5.44024 9.76245 6.6679 8.21481 8.21554C5.0892 11.3411 3.33325 15.5804 3.33325 20.0007ZM33.3333 20.0007C33.3333 22.6377 32.5513 25.2156 31.0862 27.4083C29.6211 29.6009 27.5387 31.3099 25.1024 32.319C22.666 33.3282 19.9851 33.5923 17.3987 33.0778C14.8123 32.5633 12.4365 31.2934 10.5718 29.4287C8.70713 27.564 7.43725 25.1883 6.92278 22.6019C6.40831 20.0154 6.67236 17.3346 7.68153 14.8982C8.69069 12.4619 10.3997 10.3795 12.5923 8.91439C14.785 7.4493 17.3628 6.66732 19.9999 6.66732C23.5361 6.66732 26.9275 8.07208 29.428 10.5726C31.9285 13.073 33.3333 16.4644 33.3333 20.0007Z" fill="#C3C3C3" />
              </svg>
            </div>
            <div class="spi-i-arrow-right">
              <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M26.1833 21.184C26.335 21.0255 26.4539 20.8386 26.5333 20.634C26.7 20.2282 26.7 19.7731 26.5333 19.3673C26.4539 19.1627 26.335 18.9758 26.1833 18.8173L21.1833 13.8173C20.8694 13.5035 20.4438 13.3272 19.9999 13.3272C19.5561 13.3272 19.1304 13.5035 18.8166 13.8173C18.5028 14.1312 18.3264 14.5568 18.3264 15.0007C18.3264 15.4445 18.5028 15.8702 18.8166 16.184L20.9833 18.334H14.9999C14.5579 18.334 14.134 18.5096 13.8214 18.8221C13.5089 19.1347 13.3333 19.5586 13.3333 20.0007C13.3333 20.4427 13.5089 20.8666 13.8214 21.1792C14.134 21.4917 14.5579 21.6673 14.9999 21.6673H20.9833L18.8166 23.8173C18.6604 23.9723 18.5364 24.1566 18.4518 24.3597C18.3672 24.5628 18.3236 24.7806 18.3236 25.0007C18.3236 25.2207 18.3672 25.4385 18.4518 25.6416C18.5364 25.8447 18.6604 26.0291 18.8166 26.184C18.9715 26.3402 19.1559 26.4642 19.359 26.5488C19.5621 26.6334 19.7799 26.677 19.9999 26.677C20.2199 26.677 20.4378 26.6334 20.6409 26.5488C20.844 26.4642 21.0283 26.3402 21.1833 26.184L26.1833 21.184ZM36.6666 20.0007C36.6666 16.7043 35.6891 13.482 33.8577 10.7412C32.0264 8.00034 29.4234 5.86413 26.378 4.60267C23.3325 3.34121 19.9814 3.01115 16.7484 3.65424C13.5154 4.29732 10.5457 5.88467 8.21481 8.21555C5.88394 10.5464 4.29659 13.5161 3.6535 16.7492C3.01042 19.9822 3.34047 23.3333 4.60193 26.3787C5.86339 29.4242 7.9996 32.0271 10.7404 33.8585C13.4812 35.6898 16.7036 36.6673 19.9999 36.6673C24.4202 36.6673 28.6594 34.9114 31.785 31.7858C34.9106 28.6602 36.6666 24.4209 36.6666 20.0007ZM6.66659 20.0007C6.66659 17.3636 7.44858 14.7857 8.91366 12.5931C10.3788 10.4004 12.4611 8.69143 14.8975 7.68227C17.3338 6.6731 20.0147 6.40905 22.6011 6.92352C25.1875 7.43799 27.5633 8.70787 29.428 10.5726C31.2927 12.4373 32.5626 14.813 33.0771 17.3995C33.5915 19.9859 33.3275 22.6668 32.3183 25.1031C31.3092 27.5395 29.6002 29.6218 27.4075 31.0869C25.2149 32.552 22.637 33.334 19.9999 33.334C16.4637 33.334 13.0723 31.9292 10.5718 29.4287C8.07135 26.9283 6.66659 23.5369 6.66659 20.0007Z" fill="#C3C3C3" />
              </svg>
            </div>
            <div class="spi-i-big-img" style="overflow: hidden;">
              <img src="assets/images/<?= $show_pd_detail['HinhAnh'] ?>" alt="" id="biganh"/>
            </div>
            <div class="spi-i-small-imgs">
              <?php
              foreach ($show_bienthe_hinhanh as $btha) :
              ?>
                <div class="spi-i-small-img" style="cursor: pointer;">
                  <img src="assets/images/<?= $btha['hinhanh'] ?>" alt="" onclick="anhnay(this)" />
                </div>
              <?php
              endforeach;
              ?>
            </div>
          </div>
          <div class="spi-text">
            <div class="spi-t-contents">
              <div class="spi-i-c-title h1"><?= $show_pd_detail['TenSanPham'] ?></div>
              <div class="spi-i-c-review">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <g clip-path="url(#clip0_120_1291)">
                    <path d="M13.204 0.84375C12.9832 0.328125 12.5165 0 12.004 0C11.4915 0 11.029 0.328125 10.804 0.84375L8.12488 7.04531L2.14154 8.03906C1.64154 8.12344 1.22488 8.51719 1.07071 9.05625C0.916545 9.59531 1.04154 10.1906 1.39988 10.5891L5.74154 15.4219L4.71654 22.2516C4.63321 22.8141 4.84154 23.3859 5.25404 23.7188C5.66654 24.0516 6.21238 24.0938 6.66238 23.8266L12.0082 20.6156L17.354 23.8266C17.804 24.0938 18.3499 24.0562 18.7624 23.7188C19.1749 23.3813 19.3832 22.8141 19.2999 22.2516L18.2707 15.4219L22.6124 10.5891C22.9707 10.1906 23.0999 9.59531 22.9415 9.05625C22.7832 8.51719 22.3707 8.12344 21.8707 8.03906L15.8832 7.04531L13.204 0.84375Z" fill="#E5E91D" />
                  </g>
                  <defs>
                    <clipPath id="clip0_120_1291">
                      <rect width="24" height="24" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
                <span class="p2-regular-16"><?= $tinhsao ?></span>
              </div>
              <div class="spi-i-c-price h3" style="color: var(--green-01)">
                <?= number_format($show_pd_detail['Gia'], 0, '.', '.') ?> VND
              </div>
              <div class="spi-i-c-content p2-regular-16">
                <?= $show_pd_detail['MoTa'] ?>
                <div class="spi-i-c-divider"></div>
                <div class="spi-i-c-product-variant">
                  <div class="spi-ic-pv-heading h5">Thông Số Sản Phẩm</div>
                  <div class="spi-ic-pvs">
                    <div class="spi-ic-pv">
                      <div class="spi-ic-pv-title p2-regular-16">Kích Thước</div>
                      <div class="select-input p2-regular-18">
                        <button type="button" class="select-input-button">
                          <span class="select-input-button-value p2-regular-18">Chọn Các Option</span>
                          <span class="select-input-button-arrow"></span>
                        </button>
                        <ul class="select-input-dropdown">
                          <li>
                            <input type="search" name="size" value="" id="" placeholder="Vui Lòng Nhập Từ Tìm Kiếm">
                          </li>
                          <li>
                            <input type="radio" name="" id="">
                            <label class="default" for="">Chọn Các Option</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="10" id="phu">
                            <label for="phu">10</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="12" id="vinh">
                            <label for="vinh">12</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="13" id="tan">
                            <label for="tan">13</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="14" id="thai">
                            <label for="thai">14</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="15" id="minh">
                            <label for="minh">15</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="16" id="thu">
                            <label for="thu">16</label>
                          </li>
                        </ul>
                      </div>
                    </div>
                    <div class="spi-ic-pv">
                      <div class="spi-ic-pv-title p2-regular-16">Chất Liệu</div>
                      <div class="select-input p2-regular-18">
                        <button type="button" class="select-input-button">
                          <span class="select-input-button-value p2-regular-18">Chọn Các Option</span>
                          <span class="select-input-button-arrow"></span>
                        </button>
                        <ul class="select-input-dropdown">
                          <li>
                            <input type="search" name="material" id="" placeholder="Vui Lòng Nhập Từ Tìm Kiếm">
                          </li>
                          <li>
                            <input type="radio" name="" value="nhôm" id="phu">
                            <label for="phu">nhôm</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="inox" id="vinh">
                            <label for="vinh">inox</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="đồng" id="tan">
                            <label for="tan">đồng</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="thao" id="thai">
                            <label for="thai">thao</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="chì" id="minh">
                            <label for="minh">chì</label>
                          </li>
                          <li>
                            <input type="radio" name="" value="nhựa" id="thu">
                            <label for="thu">nhựa</label>
                          </li>
                        </ul>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
              <div class="btn-main">
                <button type="submit" name="muangay" class="btn btn-primary btn-lg">Mua Ngay</button>
                <!-- <a href="cart.html"> -->
                <button type="submit" name="add_to_cart" class="btn btn-primary btn-icon btn-lg">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M2 2H3.74001C4.82001 2 5.67 2.93 5.58 4L4.75 13.96C4.61 15.59 5.89999 16.99 7.53999 16.99H18.19C19.63 16.99 20.89 15.81 21 14.38L21.54 6.88C21.66 5.22 20.4 3.87 18.73 3.87H5.82001" stroke="white" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M16.25 22C16.9404 22 17.5 21.4404 17.5 20.75C17.5 20.0596 16.9404 19.5 16.25 19.5C15.5596 19.5 15 20.0596 15 20.75C15 21.4404 15.5596 22 16.25 22Z" stroke="white" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M8.25 22C8.94036 22 9.5 21.4404 9.5 20.75C9.5 20.0596 8.94036 19.5 8.25 19.5C7.55964 19.5 7 20.0596 7 20.75C7 21.4404 7.55964 22 8.25 22Z" stroke="white" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M9 8H21" stroke="white" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"></path>
                  </svg>
                  Thêm Vô Giỏ Hàng
                </button>
                <!-- </a> -->
              </div>
              <div>
                <h1><?php if (isset($thongbao_chonoptionpd)) echo $thongbao_chonoptionpd; ?></h1>
              </div>
            </div>
          </div>
        </div>
    </section>

    <section class="product-description">
      <div class="container">
        <div class="site-product-description">
          <div class="tabs">
            <ul class="nav nav-tabs">
              <li class="nav-item p2-medium-18 show" style="width: 25%;">Chi Tiết Sản Phẩm</li>
              <li class="nav-item p2-medium-18" style="width: 25%;">Liên Hệ</li>
              <li class="nav-item p2-medium-18 " style="width: 25%;">Đánh Giá Sản Phẩm</li>
              <li class="nav-item p2-medium-18" style="width: 25%;">Sản Phẩm Liên Quan</li>
            </ul>
            <div class="tab-content">
              <div class="tab-pane p1-regular-18 active">
                <div class="spd-title h3"><?= $show_pd_detail['TenSanPham'] ?></div>
                <div class="spd-content p2-regular-16">
                  <?= $show_pd_detail['MoTa'] ?>
                </div>
                <div class="spd-info">
                  <div class="spd-i-content-left">
                    <div class="spd-icl-title h5">Chi Tiết</div>
                    <div class="spd-icl-contents">
                      <div class="spd-icl-content">
                        <div class="spd-icl-c-title p2-regular-18">
                          Kích Thước Nhẫn
                        </div>
                        <div class="spd-icl-c-content p2-regular-18">10</div>
                      </div>
                      <div class="spd-icl-content">
                        <div class="spd-icl-c-title p2-regular-18">Vật Liệu</div>
                        <div class="spd-icl-c-content p2-regular-18">Kim Loại</div>
                      </div>
                      <div class="spd-icl-content">
                        <div class="spd-icl-c-title p2-regular-18">Loại Kim Loại</div>
                        <div class="spd-icl-c-content p2-regular-18">
                          Thép Không Rĩ
                        </div>
                      </div>
                      <div class="spd-icl-content">
                        <div class="spd-icl-c-title p2-regular-18">Loại Đá Quý</div>
                        <div class="spd-icl-c-content p2-regular-18">Kim Cương</div>
                      </div>
                    </div>
                  </div>
                </div>
                <div class="spd-divider-02"></div>
              </div>
              <div class="tab-pane p1-regular-18">
                <section class="merchant-information">
                  <div class="site-merchant-information">
                    <div class="smi-heading h4">Liên Hệ </div>
                    <div class="smi-content">
                      <div class="smi-c-left">
                        <div class="smi-cl-logo">
                          <img src="assets/images/logo.png" alt="">
                        </div>
                        <div class="smi-cl-text">
                          <div class="smi-cl-t-title h5">Super Wow</div>
                        </div>
                      </div>
                      <div class="smi-c-right">
                        <div class="btn-main">
                          <button type="button" class="btn btn-outline-primary btn-icon btn-lg">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <g clip-path="url(#clip0_845_3843)">
                                <path d="M3.54953 15.763L3.54878 15.7621C2.38548 14.444 1.75022 12.8855 1.75022 11.25C1.75022 7.16191 5.97269 3.25 12.0002 3.25C18.0277 3.25 22.2502 7.16191 22.2502 11.25C22.2502 15.3381 18.0277 19.25 12.0002 19.25C10.4611 19.25 9.01134 18.9821 7.71445 18.5123C7.20649 18.3298 6.64477 18.3924 6.19008 18.6775L6.08689 18.7521C5.67293 19.0513 4.98456 19.4802 4.15781 19.8644L3.04172 20.383L3.47985 19.2329C3.72815 18.5811 3.91688 17.8502 3.97825 17.057L3.54953 15.763ZM3.54953 15.763C3.8606 16.1138 4.01494 16.5794 3.97827 17.0568L3.54953 15.763ZM1.14386 20.8881C1.17897 20.8406 1.21329 20.793 1.24681 20.7453H1.26156L1.40999 20.5227C1.49874 20.3895 1.58283 20.256 1.6622 20.1222C2.15546 19.303 2.6377 18.2061 2.73466 16.9558L2.75098 16.7454L2.61156 16.5869C1.27513 15.0678 0.500218 13.2275 0.500218 11.25C0.500218 6.23223 5.5462 2 12.0002 2C18.4542 2 23.5002 6.23223 23.5002 11.25C23.5002 16.2678 18.4542 20.5 12.0002 20.5C10.3186 20.5 8.72617 20.2099 7.29057 19.6907L7.04029 19.6002L6.82544 19.7573C6.29611 20.1443 5.4187 20.6834 4.37585 21.1368L4.37497 21.1372C3.69119 21.436 2.92029 21.7041 2.13031 21.8594L2.11783 21.8618L2.10549 21.8649C2.10555 21.8649 2.10511 21.865 2.10404 21.8653L2.09912 21.8663L2.07839 21.8703L2.07549 21.8708C2.06148 21.8734 2.03804 21.8778 2.01175 21.8839C1.81855 21.9188 1.64086 21.9472 1.45956 21.9637C1.45335 21.9641 1.44773 21.9646 1.44279 21.9651C1.42935 21.9664 1.41801 21.9681 1.40984 21.9693C1.40654 21.9699 1.40346 21.9704 1.40067 21.9709C1.1789 21.9923 0.96084 22.0047 0.745531 22.0047C0.644482 22.0047 0.553562 21.9449 0.513319 21.8483C0.475126 21.7567 0.494555 21.6503 0.568574 21.5746L0.568942 21.5743C0.780515 21.3575 0.968869 21.128 1.14386 20.8881Z" fill="#E5E91D" stroke="#E5E91D" />
                              </g>
                              <defs>
                                <clipPath id="clip0_845_3843">
                                  <rect width="24" height="24" fill="white" />
                                </clipPath>
                              </defs>
                            </svg>

                            Trò Chuyện
                          </button>
                          <button type="button" class="btn btn-outline-primary btn-icon btn-lg">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <g clip-path="url(#clip0_845_855)">
                                <path d="M1.6161 13.6594L2.07206 13.8646C2.10631 13.7884 2.14559 13.7001 2.18151 13.6153L2.29454 13.3484L2.11913 13.1177C1.10798 11.7877 0.499848 10.0984 0.499848 8.25C0.499848 3.94305 3.79334 0.5 7.79985 0.5C11.8064 0.5 15.0998 3.94305 15.0998 8.25C15.0998 12.5569 11.8064 16 7.79985 16C7.23091 16 6.67898 15.9342 6.15411 15.8038L5.94837 15.7527L5.7686 15.8651C5.60184 15.9693 5.42767 16.0736 5.25357 16.1734C3.93493 16.92 2.39153 17.5 0.899848 17.5C0.80967 17.5 0.640839 17.4273 0.543719 17.1524C0.45427 16.8871 0.504507 16.586 0.642775 16.4027L0.642812 16.4027L0.6468 16.3972C1.21147 15.6272 1.6781 14.7443 2.07243 13.8637L1.6161 13.6594ZM1.6161 13.6594C1.22985 14.5219 0.779848 15.3703 0.243598 16.1016C-0.00390201 16.4297 -0.067652 16.9078 0.071098 17.3156L6.0336 16.2891C6.59985 16.4297 7.19235 16.5 7.79985 16.5C12.1086 16.5 15.5998 12.8062 15.5998 8.25C15.5998 3.69375 12.1086 0 7.79985 0C3.4911 0 -0.000152013 3.69375 -0.000152013 8.25C-0.000152013 10.2094 0.644848 12.0047 1.7211 13.4203C1.68735 13.5 1.64985 13.5844 1.6161 13.6594ZM18.0537 21.7542L18.2311 21.8651C18.3978 21.9692 18.5718 22.0735 18.7459 22.1732C20.0645 22.9199 21.6081 23.5 23.0998 23.5C23.1916 23.5 23.3595 23.4255 23.4523 23.1571C23.5449 22.889 23.4921 22.5889 23.3553 22.4101L23.348 22.4007L23.3482 22.4006C22.788 21.6314 22.3219 20.7494 21.9243 19.8701L21.9193 19.8591L21.9194 19.8591C21.9048 19.8245 21.889 19.7892 21.8709 19.7486L21.87 19.7466C21.8527 19.708 21.8332 19.6644 21.8144 19.62L21.7014 19.3531L21.8768 19.1224C22.8918 17.7875 23.4998 16.0982 23.4998 14.25C23.4998 10.3004 20.7259 7.0736 17.1773 6.56915C17.2391 6.98304 17.2778 7.40667 17.2927 7.83843C20.5921 8.38371 22.6998 11.3417 22.6998 14.25C22.6998 15.6724 22.2361 17.0398 21.3712 18.172C20.9521 18.7215 20.8508 19.5866 21.1508 20.2847L21.1509 20.2849C21.1908 20.3758 21.2327 20.4709 21.2712 20.5622C21.3405 20.7179 21.4134 20.8725 21.4901 21.035C21.5134 21.0845 21.5371 21.1347 21.5612 21.1859L22.0554 22.2384L20.9515 21.8731C20.2798 21.6508 19.6168 21.3465 18.9926 20.9907C18.8236 20.8973 18.6583 20.7989 18.4969 20.6956M18.0537 21.7542L11.0661 17.325C12.0711 19.0031 13.8823 20.2453 16.1961 20.2453C16.6873 20.2453 17.1598 20.1891 17.6136 20.0766M18.0537 21.7542L17.8501 21.8027C17.3156 21.9302 16.7658 22 16.1999 22C13.5517 22 11.2166 20.4982 9.93394 18.2306C10.2507 18.1506 10.5626 18.0537 10.8679 17.9409L18.0537 21.7542ZM18.4969 20.6956C18.4963 20.6952 18.4958 20.6949 18.4952 20.6945L18.7648 20.2734M18.4969 20.6956C18.4972 20.6958 18.4975 20.696 18.4979 20.6962L18.7648 20.2734M18.4969 20.6956C18.2534 20.5422 17.9876 20.5013 17.732 20.5623C17.7315 20.5625 17.731 20.5626 17.7305 20.5627L17.6136 20.0766M18.7648 20.2734C18.9186 20.3719 19.0761 20.4656 19.2373 20.5547L17.6136 20.0766M18.7648 20.2734C18.4086 20.0484 18.0036 19.9828 17.6136 20.0766M2.62815 12.1762L2.62853 12.1767C3.01456 12.6828 3.13124 13.4534 2.91197 14.1218L2.83936 14.3034C2.80598 14.3868 2.76848 14.4722 2.7299 14.5555L2.72984 14.5555L2.72669 14.5626C2.63498 14.7689 2.53993 14.9745 2.43781 15.1842L1.91868 16.2503L3.04441 15.8778C3.71834 15.6548 4.38117 15.3452 5.00207 14.9961C5.17161 14.9024 5.33736 14.8037 5.4993 14.7001C5.74316 14.5465 6.00955 14.5059 6.26548 14.5674L6.26585 14.5675C6.75195 14.6839 7.26729 14.75 7.79985 14.75C11.717 14.75 14.2998 11.468 14.2998 8.25C14.2998 5.03205 11.717 1.75 7.79985 1.75C3.88269 1.75 1.29985 5.03205 1.29985 8.25C1.29985 9.67277 1.76375 11.0399 2.62815 12.1762Z" fill="#E5E91D" stroke="#E5E91D" />
                              </g>
                              <defs>
                                <clipPath id="clip0_845_855">
                                  <rect width="24" height="24" fill="white" />
                                </clipPath>
                              </defs>
                            </svg>

                            Thông Tin Liên Lạc
                          </button>
                        </div>
                      </div>
                    </div>
                    <div class="smi-divider"></div>
                  </div>

                </section>
              </div>
              <form action="" method="post">
                <div class="tab-pane p1-regular-18">
                  <section class="product-reviews">
                    <div class="site-product-reviews">
                      <div class="spr-heading h5">Đánh Giá Sản Phẩm</div>
                      <div class="spr-evaluation-summary">
                        <div class="spr-es-left">
                          <div class="spr-es-l-circle">
                            <div class="circular">
                              <div class="inner"></div>
                              <div class="outer"></div>
                              <div class="numb">
                                0
                              </div>
                              <div class="circle">
                                <div class="dot">
                                  <span></span>
                                </div>
                                <div class="bar left">
                                  <div class="progress"></div>
                                </div>
                                <div class="bar right">
                                  <div class="progress"></div>
                                </div>
                              </div>
                            </div>
                            <!-- <div class="spr-es-lc-number h5">4.8</div> -->
                          </div>
                          <div class="spr-es-l-content">
                            <div class="spr-es-lc-starts">
                              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1664)">
                                  <path d="M13.204 0.84375C12.9832 0.328125 12.5165 0 12.004 0C11.4915 0 11.029 0.328125 10.804 0.84375L8.12488 7.04531L2.14154 8.03906C1.64154 8.12344 1.22488 8.51719 1.07071 9.05625C0.916545 9.59531 1.04154 10.1906 1.39988 10.5891L5.74154 15.4219L4.71654 22.2516C4.63321 22.8141 4.84154 23.3859 5.25404 23.7188C5.66654 24.0516 6.21238 24.0938 6.66238 23.8266L12.0082 20.6156L17.354 23.8266C17.804 24.0938 18.3499 24.0562 18.7624 23.7188C19.1749 23.3813 19.3832 22.8141 19.2999 22.2516L18.2707 15.4219L22.6124 10.5891C22.9707 10.1906 23.0999 9.59531 22.9415 9.05625C22.7832 8.51719 22.3707 8.12344 21.8707 8.03906L15.8832 7.04531L13.204 0.84375Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1664">
                                    <rect width="24" height="24" fill="white" />
                                  </clipPath>
                                </defs>
                              </svg>

                              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1664)">
                                  <path d="M13.204 0.84375C12.9832 0.328125 12.5165 0 12.004 0C11.4915 0 11.029 0.328125 10.804 0.84375L8.12488 7.04531L2.14154 8.03906C1.64154 8.12344 1.22488 8.51719 1.07071 9.05625C0.916545 9.59531 1.04154 10.1906 1.39988 10.5891L5.74154 15.4219L4.71654 22.2516C4.63321 22.8141 4.84154 23.3859 5.25404 23.7188C5.66654 24.0516 6.21238 24.0938 6.66238 23.8266L12.0082 20.6156L17.354 23.8266C17.804 24.0938 18.3499 24.0562 18.7624 23.7188C19.1749 23.3813 19.3832 22.8141 19.2999 22.2516L18.2707 15.4219L22.6124 10.5891C22.9707 10.1906 23.0999 9.59531 22.9415 9.05625C22.7832 8.51719 22.3707 8.12344 21.8707 8.03906L15.8832 7.04531L13.204 0.84375Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1664">
                                    <rect width="24" height="24" fill="white" />
                                  </clipPath>
                                </defs>
                              </svg>

                              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1664)">
                                  <path d="M13.204 0.84375C12.9832 0.328125 12.5165 0 12.004 0C11.4915 0 11.029 0.328125 10.804 0.84375L8.12488 7.04531L2.14154 8.03906C1.64154 8.12344 1.22488 8.51719 1.07071 9.05625C0.916545 9.59531 1.04154 10.1906 1.39988 10.5891L5.74154 15.4219L4.71654 22.2516C4.63321 22.8141 4.84154 23.3859 5.25404 23.7188C5.66654 24.0516 6.21238 24.0938 6.66238 23.8266L12.0082 20.6156L17.354 23.8266C17.804 24.0938 18.3499 24.0562 18.7624 23.7188C19.1749 23.3813 19.3832 22.8141 19.2999 22.2516L18.2707 15.4219L22.6124 10.5891C22.9707 10.1906 23.0999 9.59531 22.9415 9.05625C22.7832 8.51719 22.3707 8.12344 21.8707 8.03906L15.8832 7.04531L13.204 0.84375Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1664">
                                    <rect width="24" height="24" fill="white" />
                                  </clipPath>
                                </defs>
                              </svg>

                              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1664)">
                                  <path d="M13.204 0.84375C12.9832 0.328125 12.5165 0 12.004 0C11.4915 0 11.029 0.328125 10.804 0.84375L8.12488 7.04531L2.14154 8.03906C1.64154 8.12344 1.22488 8.51719 1.07071 9.05625C0.916545 9.59531 1.04154 10.1906 1.39988 10.5891L5.74154 15.4219L4.71654 22.2516C4.63321 22.8141 4.84154 23.3859 5.25404 23.7188C5.66654 24.0516 6.21238 24.0938 6.66238 23.8266L12.0082 20.6156L17.354 23.8266C17.804 24.0938 18.3499 24.0562 18.7624 23.7188C19.1749 23.3813 19.3832 22.8141 19.2999 22.2516L18.2707 15.4219L22.6124 10.5891C22.9707 10.1906 23.0999 9.59531 22.9415 9.05625C22.7832 8.51719 22.3707 8.12344 21.8707 8.03906L15.8832 7.04531L13.204 0.84375Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1664">
                                    <rect width="24" height="24" fill="white" />
                                  </clipPath>
                                </defs>
                              </svg>

                              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1664)">
                                  <path d="M13.204 0.84375C12.9832 0.328125 12.5165 0 12.004 0C11.4915 0 11.029 0.328125 10.804 0.84375L8.12488 7.04531L2.14154 8.03906C1.64154 8.12344 1.22488 8.51719 1.07071 9.05625C0.916545 9.59531 1.04154 10.1906 1.39988 10.5891L5.74154 15.4219L4.71654 22.2516C4.63321 22.8141 4.84154 23.3859 5.25404 23.7188C5.66654 24.0516 6.21238 24.0938 6.66238 23.8266L12.0082 20.6156L17.354 23.8266C17.804 24.0938 18.3499 24.0562 18.7624 23.7188C19.1749 23.3813 19.3832 22.8141 19.2999 22.2516L18.2707 15.4219L22.6124 10.5891C22.9707 10.1906 23.0999 9.59531 22.9415 9.05625C22.7832 8.51719 22.3707 8.12344 21.8707 8.03906L15.8832 7.04531L13.204 0.84375Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1664">
                                    <rect width="24" height="24" fill="white" />
                                  </clipPath>
                                </defs>
                              </svg>
                            </div>
                            <div class="spr-es-lc-content p1-regular-16">khoảng <?= $demluotdanhgia ?> đánh giá</div>
                          </div>
                        </div>
                        <div class="spr-es-right">
                          <div class="spr-es-r-content">
                            <div class="spr-es-r-left">
                              <div class="spr-es-rl-number p1-medium-16">5.0</div>
                              <svg width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1683)">
                                  <path d="M11.0033 1.20312C10.8193 0.773437 10.4304 0.5 10.0033 0.5C9.57621 0.5 9.19079 0.773437 9.00329 1.20312L6.77065 6.37109L1.78454 7.19922C1.36787 7.26953 1.02065 7.59766 0.892178 8.04687C0.763706 8.49609 0.867872 8.99219 1.16648 9.32422L4.78454 13.3516L3.93037 19.043C3.86093 19.5117 4.03454 19.9883 4.37829 20.2656C4.72204 20.543 5.1769 20.5781 5.5519 20.3555L10.0068 17.6797L14.4616 20.3555C14.8366 20.5781 15.2915 20.5469 15.6352 20.2656C15.979 19.9844 16.1526 19.5117 16.0832 19.043L15.2255 13.3516L18.8436 9.32422C19.1422 8.99219 19.2498 8.49609 19.1179 8.04687C18.9859 7.59766 18.6422 7.26953 18.2255 7.19922L13.2359 6.37109L11.0033 1.20312Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1683">
                                    <rect width="20" height="20" fill="white" transform="translate(0 0.5)" />
                                  </clipPath>
                                </defs>
                              </svg>

                            </div>
                            <div class="spr-es-r-mid">
                              <div class="progress progress-md">
                                <div class="progress-bar bg-success" style="width: 30%"></div>
                              </div>
                            </div>
                            <div class="spr-es-r-right p1-medium-16">2823</div>
                          </div>
                          <div class="spr-es-r-content">
                            <div class="spr-es-r-left">
                              <div class="spr-es-rl-number p1-medium-16">4.0</div>
                              <svg width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1683)">
                                  <path d="M11.0033 1.20312C10.8193 0.773437 10.4304 0.5 10.0033 0.5C9.57621 0.5 9.19079 0.773437 9.00329 1.20312L6.77065 6.37109L1.78454 7.19922C1.36787 7.26953 1.02065 7.59766 0.892178 8.04687C0.763706 8.49609 0.867872 8.99219 1.16648 9.32422L4.78454 13.3516L3.93037 19.043C3.86093 19.5117 4.03454 19.9883 4.37829 20.2656C4.72204 20.543 5.1769 20.5781 5.5519 20.3555L10.0068 17.6797L14.4616 20.3555C14.8366 20.5781 15.2915 20.5469 15.6352 20.2656C15.979 19.9844 16.1526 19.5117 16.0832 19.043L15.2255 13.3516L18.8436 9.32422C19.1422 8.99219 19.2498 8.49609 19.1179 8.04687C18.9859 7.59766 18.6422 7.26953 18.2255 7.19922L13.2359 6.37109L11.0033 1.20312Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1683">
                                    <rect width="20" height="20" fill="white" transform="translate(0 0.5)" />
                                  </clipPath>
                                </defs>
                              </svg>

                            </div>
                            <div class="spr-es-r-mid">
                              <div class="progress progress-md">
                                <div class="progress-bar bg-success" style="width: 30%"></div>
                              </div>
                            </div>
                            <div class="spr-es-r-right p1-medium-16">38</div>
                          </div>
                          <div class="spr-es-r-content">
                            <div class="spr-es-r-left">
                              <div class="spr-es-rl-number p1-medium-16">3.0</div>
                              <svg width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1683)">
                                  <path d="M11.0033 1.20312C10.8193 0.773437 10.4304 0.5 10.0033 0.5C9.57621 0.5 9.19079 0.773437 9.00329 1.20312L6.77065 6.37109L1.78454 7.19922C1.36787 7.26953 1.02065 7.59766 0.892178 8.04687C0.763706 8.49609 0.867872 8.99219 1.16648 9.32422L4.78454 13.3516L3.93037 19.043C3.86093 19.5117 4.03454 19.9883 4.37829 20.2656C4.72204 20.543 5.1769 20.5781 5.5519 20.3555L10.0068 17.6797L14.4616 20.3555C14.8366 20.5781 15.2915 20.5469 15.6352 20.2656C15.979 19.9844 16.1526 19.5117 16.0832 19.043L15.2255 13.3516L18.8436 9.32422C19.1422 8.99219 19.2498 8.49609 19.1179 8.04687C18.9859 7.59766 18.6422 7.26953 18.2255 7.19922L13.2359 6.37109L11.0033 1.20312Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1683">
                                    <rect width="20" height="20" fill="white" transform="translate(0 0.5)" />
                                  </clipPath>
                                </defs>
                              </svg>

                            </div>
                            <div class="spr-es-r-mid">
                              <div class="progress progress-md">
                                <div class="progress-bar bg-success" style="width: 30%"></div>
                              </div>
                            </div>
                            <div class="spr-es-r-right p1-medium-16">4</div>
                          </div>
                          <div class="spr-es-r-content">
                            <div class="spr-es-r-left">
                              <div class="spr-es-rl-number p1-medium-16">2.0</div>
                              <svg width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1683)">
                                  <path d="M11.0033 1.20312C10.8193 0.773437 10.4304 0.5 10.0033 0.5C9.57621 0.5 9.19079 0.773437 9.00329 1.20312L6.77065 6.37109L1.78454 7.19922C1.36787 7.26953 1.02065 7.59766 0.892178 8.04687C0.763706 8.49609 0.867872 8.99219 1.16648 9.32422L4.78454 13.3516L3.93037 19.043C3.86093 19.5117 4.03454 19.9883 4.37829 20.2656C4.72204 20.543 5.1769 20.5781 5.5519 20.3555L10.0068 17.6797L14.4616 20.3555C14.8366 20.5781 15.2915 20.5469 15.6352 20.2656C15.979 19.9844 16.1526 19.5117 16.0832 19.043L15.2255 13.3516L18.8436 9.32422C19.1422 8.99219 19.2498 8.49609 19.1179 8.04687C18.9859 7.59766 18.6422 7.26953 18.2255 7.19922L13.2359 6.37109L11.0033 1.20312Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1683">
                                    <rect width="20" height="20" fill="white" transform="translate(0 0.5)" />
                                  </clipPath>
                                </defs>
                              </svg>

                            </div>
                            <div class="spr-es-r-mid">
                              <div class="progress progress-md">
                                <div class="progress-bar bg-success" style="width: 30%"></div>
                              </div>
                            </div>
                            <div class="spr-es-r-right p1-medium-16">0</div>
                          </div>
                          <div class="spr-es-r-content">
                            <div class="spr-es-r-left">
                              <div class="spr-es-rl-number p1-medium-16">1.0</div>
                              <svg width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_120_1683)">
                                  <path d="M11.0033 1.20312C10.8193 0.773437 10.4304 0.5 10.0033 0.5C9.57621 0.5 9.19079 0.773437 9.00329 1.20312L6.77065 6.37109L1.78454 7.19922C1.36787 7.26953 1.02065 7.59766 0.892178 8.04687C0.763706 8.49609 0.867872 8.99219 1.16648 9.32422L4.78454 13.3516L3.93037 19.043C3.86093 19.5117 4.03454 19.9883 4.37829 20.2656C4.72204 20.543 5.1769 20.5781 5.5519 20.3555L10.0068 17.6797L14.4616 20.3555C14.8366 20.5781 15.2915 20.5469 15.6352 20.2656C15.979 19.9844 16.1526 19.5117 16.0832 19.043L15.2255 13.3516L18.8436 9.32422C19.1422 8.99219 19.2498 8.49609 19.1179 8.04687C18.9859 7.59766 18.6422 7.26953 18.2255 7.19922L13.2359 6.37109L11.0033 1.20312Z" fill="#E5E91D" />
                                </g>
                                <defs>
                                  <clipPath id="clip0_120_1683">
                                    <rect width="20" height="20" fill="white" transform="translate(0 0.5)" />
                                  </clipPath>
                                </defs>
                              </svg>

                            </div>
                            <div class="spr-es-r-mid">
                              <div class="progress progress-md">
                                <div class="progress-bar bg-success" style="width: 30%"></div>
                              </div>
                            </div>
                            <div class="spr-es-r-right p1-medium-16">0</div>
                          </div>
                        </div>
                      </div>
                      <div class="spr-review-lists">
                        <div class="spr-rl-left sms-filter-options">
                          <div class="sms-fo-h-title h5">Bộ Lọc Bình Luận </div>
                          <div class="sms-fo-divider"></div>
                          <div class="sms-fo-options">
                            <div class="sms-fo-o">
                              <div class="sm-fo-o-heading">
                                <div class="sm-fo-oh-title h6">Tỉ Lệ</div>
                              </div>
                              <form action="" class="sms-fo-o-form">
                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">
                                    <svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <path d="M9.14762 0.632742C8.98201 0.246066 8.63205 0 8.24772 0C7.86338 0 7.51655 0.246066 7.34782 0.632742L5.33867 5.28339L0.851669 6.02862C0.476711 6.0919 0.164246 6.38718 0.0486335 6.79143C-0.0669786 7.19568 0.0267608 7.64211 0.295481 7.94091L3.55137 11.5651L2.7827 16.6868C2.72021 17.1086 2.87644 17.5375 3.18578 17.7871C3.49512 18.0367 3.90445 18.0683 4.24191 17.8679L8.25084 15.46L12.2598 17.8679C12.5972 18.0683 13.0066 18.0402 13.3159 17.7871C13.6252 17.534 13.7815 17.1086 13.719 16.6868L12.9472 11.5651L16.2031 7.94091C16.4718 7.64211 16.5687 7.19568 16.4499 6.79143C16.3312 6.38718 16.0218 6.0919 15.6469 6.02862L11.1568 5.28339L9.14762 0.632742Z" fill="#E5E91D" />
                                    </svg>
                                    <div class="ml-4">5</div>
                                  </div>
                                </div>

                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">
                                    <svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <path d="M9.14762 0.632742C8.98201 0.246066 8.63205 0 8.24772 0C7.86338 0 7.51655 0.246066 7.34782 0.632742L5.33867 5.28339L0.851669 6.02862C0.476711 6.0919 0.164246 6.38718 0.0486335 6.79143C-0.0669786 7.19568 0.0267608 7.64211 0.295481 7.94091L3.55137 11.5651L2.7827 16.6868C2.72021 17.1086 2.87644 17.5375 3.18578 17.7871C3.49512 18.0367 3.90445 18.0683 4.24191 17.8679L8.25084 15.46L12.2598 17.8679C12.5972 18.0683 13.0066 18.0402 13.3159 17.7871C13.6252 17.534 13.7815 17.1086 13.719 16.6868L12.9472 11.5651L16.2031 7.94091C16.4718 7.64211 16.5687 7.19568 16.4499 6.79143C16.3312 6.38718 16.0218 6.0919 15.6469 6.02862L11.1568 5.28339L9.14762 0.632742Z" fill="#E5E91D" />
                                    </svg>
                                    <div class="ml-4">4</div>
                                  </div>
                                </div>

                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">
                                    <svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <path d="M9.14762 0.632742C8.98201 0.246066 8.63205 0 8.24772 0C7.86338 0 7.51655 0.246066 7.34782 0.632742L5.33867 5.28339L0.851669 6.02862C0.476711 6.0919 0.164246 6.38718 0.0486335 6.79143C-0.0669786 7.19568 0.0267608 7.64211 0.295481 7.94091L3.55137 11.5651L2.7827 16.6868C2.72021 17.1086 2.87644 17.5375 3.18578 17.7871C3.49512 18.0367 3.90445 18.0683 4.24191 17.8679L8.25084 15.46L12.2598 17.8679C12.5972 18.0683 13.0066 18.0402 13.3159 17.7871C13.6252 17.534 13.7815 17.1086 13.719 16.6868L12.9472 11.5651L16.2031 7.94091C16.4718 7.64211 16.5687 7.19568 16.4499 6.79143C16.3312 6.38718 16.0218 6.0919 15.6469 6.02862L11.1568 5.28339L9.14762 0.632742Z" fill="#E5E91D" />
                                    </svg>
                                    <div class="ml-4">3</div>
                                  </div>
                                </div>

                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">
                                    <svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <path d="M9.14762 0.632742C8.98201 0.246066 8.63205 0 8.24772 0C7.86338 0 7.51655 0.246066 7.34782 0.632742L5.33867 5.28339L0.851669 6.02862C0.476711 6.0919 0.164246 6.38718 0.0486335 6.79143C-0.0669786 7.19568 0.0267608 7.64211 0.295481 7.94091L3.55137 11.5651L2.7827 16.6868C2.72021 17.1086 2.87644 17.5375 3.18578 17.7871C3.49512 18.0367 3.90445 18.0683 4.24191 17.8679L8.25084 15.46L12.2598 17.8679C12.5972 18.0683 13.0066 18.0402 13.3159 17.7871C13.6252 17.534 13.7815 17.1086 13.719 16.6868L12.9472 11.5651L16.2031 7.94091C16.4718 7.64211 16.5687 7.19568 16.4499 6.79143C16.3312 6.38718 16.0218 6.0919 15.6469 6.02862L11.1568 5.28339L9.14762 0.632742Z" fill="#E5E91D" />
                                    </svg>
                                    <div class="ml-4">2</div>
                                  </div>
                                </div>

                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">
                                    <svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <path d="M9.14762 0.632742C8.98201 0.246066 8.63205 0 8.24772 0C7.86338 0 7.51655 0.246066 7.34782 0.632742L5.33867 5.28339L0.851669 6.02862C0.476711 6.0919 0.164246 6.38718 0.0486335 6.79143C-0.0669786 7.19568 0.0267608 7.64211 0.295481 7.94091L3.55137 11.5651L2.7827 16.6868C2.72021 17.1086 2.87644 17.5375 3.18578 17.7871C3.49512 18.0367 3.90445 18.0683 4.24191 17.8679L8.25084 15.46L12.2598 17.8679C12.5972 18.0683 13.0066 18.0402 13.3159 17.7871C13.6252 17.534 13.7815 17.1086 13.719 16.6868L12.9472 11.5651L16.2031 7.94091C16.4718 7.64211 16.5687 7.19568 16.4499 6.79143C16.3312 6.38718 16.0218 6.0919 15.6469 6.02862L11.1568 5.28339L9.14762 0.632742Z" fill="#E5E91D" />
                                    </svg>
                                    <div class="ml-4">1</div>
                                  </div>
                                </div>


                              </form>
                            </div>
                            <div class="sms-fo-o-divider"></div>
                            <div class="sms-fo-o">
                              <div class="sm-fo-o-heading">
                                <div class="sm-fo-oh-title h5">Chủ Đề Bình Luận</div>
                              </div>
                              <form action="" class="sms-fo-o-form">
                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">Chất Lượng Sản Phẩm</div>
                                </div>
                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">Dịch Vụ Chăm Sóc</div>
                                </div>
                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">Giá Sản Phẩm</div>
                                </div>
                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">Vận Chuyển</div>
                                </div>
                                <div class="checkbox-group">
                                  <input type="checkbox" name="" class="form-checkbox" id="">
                                  <div class="checkbox-content">Khớp Với Mô Tả</div>
                                </div>
                              </form>
                            </div>
                          </div>
                        </div>
                        <div class="spr-rl-right">
                          <div class="spr-rl-r-heading h5">Danh Sách Bình Luận</div>
                          <?php
                          if (isset($_SESSION['user']) && !empty($_SESSION['user'])) {
                          ?>
                            <div class="spr-rl-r-form">
                              <form action="" method="post">
                                <div class="spr-rl-rf-left">
                                  <div class="spr-rl-rf-l-img">
                                    <img src="assets/images/UserDefault.png" alt="">
                                  </div>
                                  <div class="spr-rl-rf-l-content">
                                    <div class="spr-rl-rf-lc-title h6"><?= $_SESSION['user']['UserName'] ?></div>
                                    <!-- <div class="rating">
                                  <img src="assets/images/star.png" alt="1" title="bad">
                                  <img src="assets/images/unstar.png" alt="2" title="poor">
                                  <img src="assets/images/unstar.png" alt="3" title="regular">
                                  <img src="assets/images/unstar.png" alt="4" title="good">
                                  <img src="assets/images/unstar.png" alt="5" title="gorgeous">
                                </div> -->
                                    <div class="rating">
                                      <input value="5" name="rating" id="star5" type="radio">
                                      <label for="star5"></label>
                                      <input value="4" name="rating" id="star4" type="radio">
                                      <label for="star4"></label>
                                      <input value="3" name="rating" id="star3" type="radio">
                                      <label for="star3"></label>
                                      <input value="2" name="rating" id="star2" type="radio">
                                      <label for="star2"></label>
                                      <input value="1" name="rating" id="star1" type="radio">
                                      <label for="star1"></label>
                                    </div>
                                    <div class="form-group">
                                      <input type="text" name="comment_content" class="form-control form-lg" placeholder="Nhập Bình Luận Của Bạn..........">
                                    </div>
                                  </div>
                                </div>
                                <div class="spr-rl-rf-right">
                                  <button type="submit" name="comment_submit" class="btn btn-outline-primary btn-icon">
                                    <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <g clip-path="url(#clip0_845_2233)">
                                        <path d="M4.04953 15.763L4.04878 15.7621C2.88548 14.444 2.25022 12.8855 2.25022 11.25C2.25022 7.16191 6.47269 3.25 12.5002 3.25C18.5277 3.25 22.7502 7.16191 22.7502 11.25C22.7502 15.3381 18.5277 19.25 12.5002 19.25C10.9611 19.25 9.51134 18.9821 8.21445 18.5123C7.70649 18.3298 7.14477 18.3924 6.69008 18.6775L6.58689 18.7521C6.17293 19.0513 5.48456 19.4802 4.65781 19.8644L3.54172 20.383L3.97985 19.2329C4.22815 18.5811 4.41688 17.8502 4.47825 17.057L4.04953 15.763ZM4.04953 15.763C4.3606 16.1138 4.51494 16.5794 4.47827 17.0568L4.04953 15.763ZM1.64386 20.8881C1.67897 20.8406 1.71329 20.793 1.74681 20.7453H1.76156L1.90999 20.5227C1.99874 20.3895 2.08283 20.256 2.1622 20.1222C2.65546 19.303 3.1377 18.2061 3.23466 16.9558L3.25098 16.7454L3.11156 16.5869C1.77513 15.0678 1.00022 13.2275 1.00022 11.25C1.00022 6.23223 6.0462 2 12.5002 2C18.9542 2 24.0002 6.23223 24.0002 11.25C24.0002 16.2678 18.9542 20.5 12.5002 20.5C10.8186 20.5 9.22617 20.2099 7.79057 19.6907L7.54029 19.6002L7.32544 19.7573C6.79611 20.1443 5.9187 20.6834 4.87585 21.1368L4.87497 21.1372C4.19119 21.436 3.42029 21.7041 2.63031 21.8594L2.61783 21.8618L2.60549 21.8649C2.60555 21.8649 2.60511 21.865 2.60404 21.8653L2.59912 21.8663L2.57839 21.8703L2.57549 21.8708C2.56148 21.8734 2.53804 21.8778 2.51175 21.8839C2.31855 21.9188 2.14086 21.9472 1.95956 21.9637C1.95335 21.9641 1.94773 21.9646 1.94279 21.9651C1.92935 21.9664 1.91801 21.9681 1.90984 21.9693C1.90654 21.9699 1.90346 21.9704 1.90067 21.9709C1.6789 21.9923 1.46084 22.0047 1.24553 22.0047C1.14448 22.0047 1.05356 21.9449 1.01332 21.8483C0.975126 21.7567 0.994555 21.6503 1.06857 21.5746L1.06894 21.5743C1.28051 21.3575 1.46887 21.128 1.64386 20.8881Z" fill="#E5E91D" stroke="#E5E91D" />
                                      </g>
                                      <defs>
                                        <clipPath id="clip0_845_2233">
                                          <rect width="24" height="24" fill="white" transform="translate(0.5)" />
                                        </clipPath>
                                      </defs>
                                    </svg>

                                    Bình Luận
                                  </button>
                                </div>
                              </form>
                            </div>
                          <?php
                          }
                          ?>
                          <div class="spr-rl-r-tags mt-16">
                            <button type="button" class="btn btn-outline-primary">Tất Cả Bình Luận</button>
                            <button type="button" class="btn btn-outline-primary ml-16">Với Ảnh Và Video</button>
                            <button type="button" class="btn btn-outline-primary ml-16">Với Mô Tả</button>
                          </div>
                          <div class=" spr-rl-r-review-users">
                            <?php foreach ($showten_alluser_cm as $showbl) : extract($showbl) ?>
                              <div class="spr-rl-r-ru-user">
                                <div class="spr-rl-r-ru-u-left">
                                  <div class="spr-rl-r-ru-ul-stars">
                                    <?php
                                    for ($i = 0; $i < 5; $i++) {
                                      if ($i < $ngoisao) {
                                    ?>
                                        <svg width="17" height="18" viewBox="0 0 17 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                          <path d="M9.14762 0.632742C8.98201 0.246066 8.63205 0 8.24772 0C7.86338 0 7.51655 0.246066 7.34782 0.632742L5.33867 5.28339L0.851669 6.02862C0.476711 6.0919 0.164246 6.38718 0.0486335 6.79143C-0.0669786 7.19568 0.0267608 7.64211 0.295481 7.94091L3.55137 11.5651L2.7827 16.6868C2.72021 17.1086 2.87644 17.5375 3.18578 17.7871C3.49512 18.0367 3.90445 18.0683 4.24191 17.8679L8.25084 15.46L12.2598 17.8679C12.5972 18.0683 13.0066 18.0402 13.3159 17.7871C13.6252 17.534 13.7815 17.1086 13.719 16.6868L12.9472 11.5651L16.2031 7.94091C16.4718 7.64211 16.5687 7.19568 16.4499 6.79143C16.3312 6.38718 16.0218 6.0919 15.6469 6.02862L11.1568 5.28339L9.14762 0.632742Z" fill="#E5E91D" />
                                        </svg>
                                      <?php
                                      } else {
                                      ?>
                                        <img src="assets/images/unstar.png" style="width: 17px; height: 18px;">
                                    <?php
                                      }
                                    }
                                    ?>
                                  </div>
                                  <div class="spr-rl-r-ru-ul-text">
                                    <div class="spr-rl-r-ru-ul-t-title h6"><?= $UserName ?></div>
                                    <div class="spr-rl-r-ru-ul-t-date p2-regular-16" style="color: var(--black-03)">
                                      <?= $time ?>
                                    </div>
                                    <div class="spr-rl-r-ru-ul-t-user">
                                      <div class="spr-rl-r-ru-ul-t-u-avatar">
                                        <img src="assets/images/UserDefault.png" alt="">
                                      </div>
                                      <div class="spr-rl-r-ru-ul-t-u-name p2-medium-16"><?= $NoiDung ?></div>
                                    </div>
                                  </div>
                                </div>
                                <div class="spr-rl-r-ru-u-right">



                                  <button type="submit" name="tanglike" value="<?= $id_binhluan ?>" style="background: transparent;" class="spr-rl-r-ru-ur-like">
                                    <input type="hidden" name="solike" value="<?= $soluonglike ?>">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <g clip-path="url(#clip0_148_8374)">
                                        <path d="M7.48047 18.3502L10.5805 20.7502C10.9805 21.1502 11.8805 21.3502 12.4805 21.3502H16.2805C17.4805 21.3502 18.7805 20.4502 19.0805 19.2502L21.4805 11.9502C21.9805 10.5502 21.0805 9.3502 19.5805 9.3502H15.5805C14.9805 9.3502 14.4805 8.8502 14.5805 8.1502L15.0805 4.9502C15.2805 4.0502 14.6805 3.0502 13.7805 2.7502C12.9805 2.4502 11.9805 2.8502 11.5805 3.4502L7.48047 9.5502" stroke="#0B0F0E" stroke-width="1.5" stroke-miterlimit="10" />
                                        <path d="M2.37988 18.3502V8.5502C2.37988 7.1502 2.97988 6.6502 4.37988 6.6502H5.37988C6.77988 6.6502 7.37988 7.1502 7.37988 8.5502V18.3502C7.37988 19.7502 6.77988 20.2502 5.37988 20.2502H4.37988C2.97988 20.2502 2.37988 19.7502 2.37988 18.3502Z" stroke="#0B0F0E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                                      </g>
                                      <defs>
                                        <clipPath id="clip0_148_8374">
                                          <rect width="24" height="24" fill="white" />
                                        </clipPath>
                                      </defs>
                                    </svg>
                                    <div class="spr-rl-r-ru-ur-l-number p1-regular-16"><?= $soluonglike ?></div>
                                  </button>
                                  <button type="submit" name="tangdislike" value="<?= $id_binhluan ?>" style="background: transparent;" class="spr-rl-r-ru-ur-dislike">
                                    <input type="hidden" name="sodislike" value="<?= $soluongdislike ?>">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <g clip-path="url(#clip0_61_3790)">
                                        <path d="M7.48047 5.65012L10.5805 3.25012C10.9805 2.85012 11.8805 2.65012 12.4805 2.65012H16.2805C17.4805 2.65012 18.7805 3.55012 19.0805 4.75012L21.4805 12.0501C21.9805 13.4501 21.0805 14.6501 19.5805 14.6501H15.5805C14.9805 14.6501 14.4805 15.1501 14.5805 15.8501L15.0805 19.0501C15.2805 19.9501 14.6805 20.9501 13.7805 21.2501C12.9805 21.5501 11.9805 21.1501 11.5805 20.5501L7.48047 14.4501" stroke="#0B0F0E" stroke-width="1.5" stroke-miterlimit="10" />
                                        <path d="M2.37988 5.65012V15.4501C2.37988 16.8501 2.97988 17.3501 4.37988 17.3501H5.37988C6.77988 17.3501 7.37988 16.8501 7.37988 15.4501V5.65012C7.37988 4.25012 6.77988 3.75012 5.37988 3.75012H4.37988C2.97988 3.75012 2.37988 4.25012 2.37988 5.65012Z" stroke="#0B0F0E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                                      </g>
                                      <defs>
                                        <clipPath id="clip0_61_3790">
                                          <rect width="24" height="24" fill="white" transform="matrix(1 0 0 -1 0 24.0001)" />
                                        </clipPath>
                                      </defs>
                                    </svg>
                                    <div class="spr-rl-r-ru-ur-l-number p1-regular-16"><?= $soluongdislike ?></div>
                                  </button>



                                </div>
                              </div>
                            <?php endforeach; ?>
                            <div class="spr-rl-r-ru-u-divider"></div>
                          </div>
                        </div>
                      </div>
                      <div class="sms-paggination">
                        <ul class="pagination">
                          <a href="javascript:void(0)" class="page-item icon-left" value="icon-left">
                            <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <g clip-path="url(#clip0_580_6313)">
                                <path d="M0.503209 11.0184C-0.166434 11.6043 -0.166434 12.5559 0.503209 13.1418L9.07464 20.6418C9.74428 21.2277 10.8318 21.2277 11.5014 20.6418C12.1711 20.0559 12.1711 19.1043 11.5014 18.5184L5.84964 13.5777H22.2854C23.2336 13.5777 23.9996 12.9074 23.9996 12.0777C23.9996 11.248 23.2336 10.5777 22.2854 10.5777H5.85499L11.4961 5.63711C12.1657 5.05117 12.1657 4.09961 11.4961 3.51367C10.8264 2.92773 9.73892 2.92773 9.06928 3.51367L0.497852 11.0137L0.503209 11.0184Z" fill="black"></path>
                              </g>
                              <defs>
                                <clipPath id="clip0_580_6313">
                                  <rect width="24" height="24" fill="white" transform="translate(0 0.078125)"></rect>
                                </clipPath>
                              </defs>
                            </svg>

                          </a>
                          <a href="javascript:void(0)" class="page-item active" value="1">
                            <li class=" p3-medium-14">1</li>
                          </a>
                          <a href="javascript:void(0)" class="page-item" value="2">
                            <li class=" p3-medium-14">2</li>
                          </a>
                          <a href="javascript:void(0)" class="page-item" value="...">
                            <li class=" p3-medium-14">...</li>
                          </a>
                          <a href="javascript:void(0)" class="page-item" value="19">
                            <li class=" p3-medium-14">19</li>
                          </a>
                          <a href="javascript:void(0)" class="page-item icon-right" value="icon-right">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <path d="M23.4964 13.059C24.1661 12.473 24.1661 11.5215 23.4964 10.9355L14.925 3.43555C14.2554 2.84961 13.1679 2.84961 12.4982 3.43555C11.8286 4.02148 11.8286 4.97305 12.4982 5.55898L18.15 10.4996H1.71429C0.766071 10.4996 0 11.1699 0 11.9996C0 12.8293 0.766071 13.4996 1.71429 13.4996H18.1446L12.5036 18.4402C11.8339 19.0262 11.8339 19.9777 12.5036 20.5637C13.1732 21.1496 14.2607 21.1496 14.9304 20.5637L23.5018 13.0637L23.4964 13.059Z" fill="#028C35"></path>
                            </svg>
                          </a>
                        </ul>
                      </div>
                      <div class="spr-divider"></div>
                    </div>
                </div>
              </form>
              <div class="tab-pane p1-regular-18">
                <section class="related-products popular-products">
                  <div class="site-pop-pro">
                    <div class="site-fea-cat">
                      <div class="sf-cat-title">
                        <div class="sfc-title h5">Sản Phẩm Tương Tự</div>
                        <button type="button" class="btn btn-outline-primary btn-lg">Xem Chi Tiết</button>
                      </div>
                    </div>
                    <div class="product-card">
                      <?php
                      foreach ($show_sp_tuongtu as $sptt) :
                        extract($sptt);
                      ?>
                        <div class="card-product card-product-another">
                          <img src="assets/images/<?= $HinhAnh ?>" alt="" class="card-img">
                          <div class="card-product-header">
                            <div class="card-product-title h4"><?= $TenSanPham ?></div>
                          </div>
                          <div class="card-product-body">
                            <div class="card-product-description p1-regular-16"><?= $MoTa ?></div>
                            <div class="card-product-text h3" style="color: var(--green-01)">
                              <?= $Gia ?>
                            </div>
                            <a href="?mod=page&act=productDetails&idsp=<?= $id_sanpham ?>" class="btn btn-outline-primary btn-lg">Xem Chi Tiết</a>
                          </div>
                        </div>
                      <?php
                      endforeach;
                      ?>
                      <!-- <div class="card-product card-product-another">
                        <img src="assets/images/product-01.png" alt="" class="card-img">
                        <div class="card-product-header">
                          <div class="card-product-title h4">Tên Sản Phẩm</div>
                        </div>
                        <div class="card-product-body">
                          <div class="card-product-description p1-regular-16">Lorem ipsum dolor sit amet, consectetur
                            adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut
                            enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea
                            commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum
                            dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in
                            culpa qui officia deserunt mollit anim id est laborum.</div>
                          <div class="card-product-text h3" style="color: var(--green-01)">
                            Giá Sản Phẩm
                          </div>
                        </div>
                      </div>
                      <div class="card-product card-product-another">
                        <img src="assets/images/product-01.png" alt="" class="card-img">
                        <div class="card-product-header">
                          <div class="card-product-title h4">Tên Sản Phẩm</div>
                        </div>
                        <div class="card-product-body">
                          <div class="card-product-description p1-regular-16">Lorem ipsum dolor sit amet, consectetur
                            adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut
                            enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea
                            commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum
                            dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in
                            culpa qui officia deserunt mollit anim id est laborum.</div>
                          <div class="card-product-text h3" style="color: var(--green-01)">
                            Giá Sản Phẩm
                          </div>
                        </div>
                      </div>
                      <div class="card-product card-product-another">
                        <img src="assets/images/product-01.png" alt="" class="card-img">
                        <div class="card-product-header">
                          <div class="card-product-title h4">Tên Sản Phẩm</div>
                        </div>
                        <div class="card-product-body">
                          <div class="card-product-description p1-regular-16">Lorem ipsum dolor sit amet, consectetur
                            adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut
                            enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea
                            commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum
                            dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in
                            culpa qui officia deserunt mollit anim id est laborum.</div>
                          <div class="card-product-text h3" style="color: var(--green-01)">
                            Giá Sản Phẩm
                          </div>
                        </div>
                      </div> -->
                    </div>
                  </div>
                </section>
              </div>
    </section>
    </div>
  </form>
<?php
} else {
  echo "<div style='margin: 20px 0; text-align: center; width: 100%;'><h1>Trang này không tồn tại!</h1></div>";
}
?>
<script>
  var anhmain = document.getElementById('biganh');
  function anhnay(e){
    anhmain.src = e.src;
  }
</script>